#### AreItemFilesLoaded Method

---

|  |
| --- |
| FabricationConfiguration Class   See Also |

Checks if the fabrication item files have been loaded.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool AreItemFilesLoaded( 	IList<FabricationItemFile> itemFiles ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AreItemFilesLoaded ( _ 	itemFiles As IList(Of FabricationItemFile) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AreItemFilesLoaded( 	IList<FabricationItemFile^>^ itemFiles ) ``` |

#### Parameters

itemFiles
:   Type:  System.Collections.Generic IList   FabricationItemFile
     The fabrication item files.

#### Return Value

Returns true if the fabrication item files have been loaded, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationConfiguration Class

Autodesk.Revit.DB Namespace